Revit 2024 API
BuiltInFailures.WallFailures.WallCutoutForInsertionFailure Property
 Can't cut wall for inserted objects
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WallCutoutForInsertionFailure { get; }
Visual Basic
Public Shared ReadOnly Property WallCutoutForInsertionFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WallCutoutForInsertionFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace